lib/authenticate_helper.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "thai@gmail.com"], ["LIMIT", 1]]
---
  def authenticate_user
    @email =
      JsonWebTokenService.decode(request.headers['HTTP_AUTH_TOKEN'])["email"]
    @current_user = User.find_by(email: @email)