app/controllers/api/v1/brands_controller.rb

      def index
        @brands = Brand.all
---
SELECT "brands".* FROM "brands"

      def create
        @brand = Brand.new(brand_params)

        if @brand.save
---
INSERT INTO "brands" ("name", "avatar", "short_name", "status", "store_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "\"thaithai\""], ["avatar", nil], ["short_name", nil], ["status", nil], ["store_number", nil], ["created_at", "2023-11-11 06:54:30.199826"], ["updated_at", "2023-11-11 06:54:30.199826"]]

      def set_brand
        @brand = Brand.find(params[:id])
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]