app/controllers/api/v1/cards_controller.rb

SELECT "cards".* FROM "cards"
---
      def index
        @cards = Card.all

INSERT INTO "cards" ("name", "price", "pin", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "black"], ["price", nil], ["pin", nil], ["status", nil], ["user_id", 1], ["created_at", "2023-11-11 13:40:01.653116"], ["updated_at", "2023-11-11 13:40:01.653116"]]
---
      def request_new_card
        @card = current_user.cards.new(card_request_params)

        if @card.save

SELECT "cards".* FROM "cards" WHERE "cards"."user_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 27], ["LIMIT", 1]]
---
      def set_card
        @card = current_user.cards.find(params[:id])