app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products"
---
      def index
        @products = Product.all

INSERT INTO "products" ("name", "avatar", "sku", "status", "price", "brand_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
      def create
        @product = Product.new(product_params)
        if @product.save