app/controllers/api/v1/reports_controller.rb

      def all_products_of_user
        card_ids = current_user.cards.pluck(:id)
        @products = Product.joins(:cards).where("card_id in (?)",card_ids)
---
SELECT "cards"."id" FROM "cards" WHERE "cards"."user_id" = $1  [["user_id", 1]]
SELECT "products".* FROM "products" INNER JOIN "card_products" ON "card_products"."product_id" = "products"."id" INNER JOIN "cards" ON "cards"."id" = "card_products"."card_id" WHERE (card_id in (27,28))