app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "name", "role", "status", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    user_params['role'] = 'client'
    if @user.save